#!/usr/bin/env python 3
# -*- config: utf-8 -*-

if __name__ == '__main__':
    school = {'1а': 25, '1б': 27, '1в': 21, '2а': 22, '2б': 24, '2в': 28, '3а': 25, '3б': 27, '3в': 21, '4а': 25, '4б': 27, '4в': 21, '5а': 25, '5б': 27, '5в': 21, '6а': 25, '6б': 27, '6в': 21, '7а': 25, '7б': 27, '7в': 21, '8а': 25, '8б': 27, '8в': 21, '9а': 25, '9б': 27, '9в': 21, '10а': 25, '10б': 27, '10в': 21, '11а': 25, '11б': 27, '11в': 21}

    school['10а'] = 15
    del school['7б']
    school['7г'] = 11

    pupils = 0
    for i, j in enumerate(school):
        pupils += school[j]
        print(j, ":", school[j])
    print(f"Общее число учащихся в школе: {pupils}")
